[NoCoverage] ArrowFunction
Study/Project_gol_saga/src/App.tsx:8:20
 import { About } from './components/About';
 import { Main } from './components/Main';
 
-export const App = () => (
-    <React.StrictMode>
-        <HashRouter>
-            <div className="App">
-                <h2>Проект OTUS: реализация игры Game of Life</h2>
-                <Routes>
-                    <Route path="/" element={<Home />} />
-                    <Route path="about" element={<About />} />
-                    <Route path="game" element={<Main />} />
-                </Routes>
-            </div>
-        </HashRouter>
-    </React.StrictMode>
-);
+export const App = () => undefined;
 
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');

[NoCoverage] LogicalOperator
Study/Project_gol_saga/src/App.tsx:23:34
     </React.StrictMode>
 );
 
-const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');
+const rootElement: HTMLElement = document.getElementById('root') && document.createElement('');
 const root = createRoot(rootElement);
 

[NoCoverage] StringLiteral
Study/Project_gol_saga/src/App.tsx:23:92
     </React.StrictMode>
 );
 
-const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');
+const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement("Stryker was here!");
 const root = createRoot(rootElement);
 

[NoCoverage] BlockStatement
Study/Project_gol_saga/src/App.tsx:26:26
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');
 const root = createRoot(rootElement);
 
-export function render() {
-    root.render(<App/>);
-}
+export function render() {}
