[NoCoverage] BooleanLiteral
src/components/Button/Button.tsx:32:13
  * Primary UI component for user interaction
  */
 export const Button = ({
-  primary = false,
+  primary = true,
   size = 'medium',
   backgroundColor,

[Killed] BlockStatement
src/components/Button/Button.tsx:38:20
   label,
   id,
   ...props
-}: ButtonProps) => {
-  const mode = primary ? 'storybook-button--primary' : 'storybook-button--secondary';
-  return (
-    <button
-      data-testid={id}
-      type="button"
-      className={['storybook-button', `storybook-button--${size}`, mode].join(' ')}
-      style={{ backgroundColor }}
-      {...props}
-    >
-      {label}
-    </button>
-  );
-};
+}: ButtonProps) => {};
 
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 21
+ Received  +  0

@@ -6,31 +6,10 @@

[NoCoverage] StringLiteral
src/components/Button/Button.tsx:39:56
   id,
   ...props
 }: ButtonProps) => {
-  const mode = primary ? 'storybook-button--primary' : 'storybook-button--secondary';
+  const mode = primary ? 'storybook-button--primary' : "";
   return (
     <button

[Killed] ArrayDeclaration
src/components/Button/Button.tsx:44:18
     <button
       data-testid={id}
       type="button"
-      className={['storybook-button', `storybook-button--${size}`, mode].join(' ')}
+      className={[].join(' ')}
       style={{ backgroundColor }}
       {...props}
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 3
+ Received  + 3

@@ -7,25 +7,25 @@

[Killed] StringLiteral
src/components/Button/Button.tsx:44:79
     <button
       data-testid={id}
       type="button"
-      className={['storybook-button', `storybook-button--${size}`, mode].join(' ')}
+      className={['storybook-button', `storybook-button--${size}`, mode].join("")}
       style={{ backgroundColor }}
       {...props}
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 3
+ Received  + 3

@@ -7,25 +7,25 @@
