[Killed] ArrowFunction
src/components/Game/Game.tsx:16:21
   clear: ActionExecutor
 }
 
-export const Game = (data: GameParams
-) => (
-  <div>
-    <Button id='go' label={data.running ? 'Stop' : 'Start'} onClick={data.running ? data.stop : data.start} primary size='small' />
-    <Button id='clear' label='Clear' onClick={data.clear} primary size='small' />
-    <Button id='generate' label='Generate' onClick={data.generate} primary size='small' />
-    <Table table={data.table} />
-  </div>
-);
+export const Game = () => undefined;
killedBy: Game component check suite render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Game component check suite render 1`

- Snapshot  - 37
+ Received  +  1

- <DocumentFragment>

[Killed] StringLiteral
src/components/Game/Game.tsx:19:52
 export const Game = (data: GameParams
 ) => (
   <div>
-    <Button id='go' label={data.running ? 'Stop' : 'Start'} onClick={data.running ? data.stop : data.start} primary size='small' />
+    <Button id='go' label={data.running ? 'Stop' : ""} onClick={data.running ? data.stop : data.start} primary size='small' />
     <Button id='clear' label='Clear' onClick={data.clear} primary size='small' />
     <Button id='generate' label='Generate' onClick={data.generate} primary size='small' />
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 3
+ Received  + 1

@@ -10,13 +10,11 @@
