[NoCoverage] BlockStatement
Project_gol_saga/src/pages/_app.tsx:6:53
 import {Provider} from 'react-redux';
 import { store } from '../store';
 
-export default function App({Component, pageProps}) {
-  return (
-      <Provider store={store}>
-        <Component {...pageProps} />
-      </Provider>
-  );
-}
+export default function App({Component, pageProps}) {}
