[NoCoverage] BlockStatement
Project_gol_saga/src/pages/index.tsx:4:33
 import React from 'react';
 import { Main } from '../components/Main';
 
-export default function Index() {
-  return (
-    <Main/>
-  )
-}
+export default function Index() {}
 
 /*const Home = (): JSX.Element => {
