[Survived] BlockStatement
Study/Project_gol_saga/src/sagas.ts:5:25
 import { take, put, call, CallEffect, RaceEffect, ForkEffect, TakeEffect, SimpleEffect, fork, cancel, cancelled, race, CancelEffect } from "redux-saga/effects";
 import { timerMs, NEXT_GENERATION, START, STOP, CLEAR } from './game';
 
-export function timer() {
-    return eventChannel(emitter => {
-        const iv = setInterval(() => {
-            emitter(timerMs);
-        }, timerMs);
-        return () => {
-            clearInterval(iv);
-        };
-    });
-}
+export function timer() {}
   
 export function* timerSaga(): Generator<any> {

[Survived] BlockStatement
Study/Project_gol_saga/src/sagas.ts:6:36
 import { timerMs, NEXT_GENERATION, START, STOP, CLEAR } from './game';
 
 export function timer() {
-    return eventChannel(emitter => {
-        const iv = setInterval(() => {
-            emitter(timerMs);
-        }, timerMs);
-        return () => {
-            clearInterval(iv);
-        };
-    });
+    return eventChannel(emitter => {});
 }
   

[NoCoverage] BlockStatement
Study/Project_gol_saga/src/sagas.ts:7:38
 
 export function timer() {
     return eventChannel(emitter => {
-        const iv = setInterval(() => {
-            emitter(timerMs);
-        }, timerMs);
+        const iv = setInterval(() => {}, timerMs);
         return () => {
             clearInterval(iv);

[Survived] BlockStatement
Study/Project_gol_saga/src/sagas.ts:10:22
         const iv = setInterval(() => {
             emitter(timerMs);
         }, timerMs);
-        return () => {
-            clearInterval(iv);
-        };
+        return () => {};
     });
 }

[Killed] BlockStatement
Study/Project_gol_saga/src/sagas.ts:16:46
     });
 }
   
-export function* timerSaga(): Generator<any> {
-    const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
-    try {
-        while (true) {
-            yield take(chan);
-            yield put({ type: NEXT_GENERATION });
-        }
-    } finally {
-        if (yield cancelled) {
-            chan.close();
-        }
-    }
-}
+export function* timerSaga(): Generator<any> {}
   
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
killedBy: sagas timer saga redux-saga-test-plan
statusReason: SagaTestError: 
Assertion 1 failed: expected call effect, but the saga yielded nothing

[Survived] BlockStatement
Study/Project_gol_saga/src/sagas.ts:18:9
   
 export function* timerSaga(): Generator<any> {
     const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
-    try {
-        while (true) {
-            yield take(chan);
-            yield put({ type: NEXT_GENERATION });
-        }
-    } finally {
+    try {} finally {
         if (yield cancelled) {
             chan.close();

[Timeout] BlockStatement
Study/Project_gol_saga/src/sagas.ts:19:22
 export function* timerSaga(): Generator<any> {
     const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
     try {
-        while (true) {
-            yield take(chan);
-            yield put({ type: NEXT_GENERATION });
-        }
+        while (true) {}
     } finally {
         if (yield cancelled) {

[Survived] BooleanLiteral
Study/Project_gol_saga/src/sagas.ts:19:16
 export function* timerSaga(): Generator<any> {
     const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
     try {
-        while (true) {
+        while (false) {
             yield take(chan);
             yield put({ type: NEXT_GENERATION });

[Survived] BlockStatement
Study/Project_gol_saga/src/sagas.ts:23:15
             yield take(chan);
             yield put({ type: NEXT_GENERATION });
         }
-    } finally {
-        if (yield cancelled) {
-            chan.close();
-        }
-    }
+    } finally {}
 }
   

[Survived] ConditionalExpression
Study/Project_gol_saga/src/sagas.ts:24:13
             yield put({ type: NEXT_GENERATION });
         }
     } finally {
-        if (yield cancelled) {
+        if (true) {
             chan.close();
         }

[Survived] ConditionalExpression
Study/Project_gol_saga/src/sagas.ts:24:13
             yield put({ type: NEXT_GENERATION });
         }
     } finally {
-        if (yield cancelled) {
+        if (false) {
             chan.close();
         }

[Killed] BlockStatement
Study/Project_gol_saga/src/sagas.ts:32:63
   
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
 
-export function* rootSaga(): Generator<YieldType, void, Task> {
-    while (yield take(START)) {
-        const asyncTask: Task = (yield fork(timerSaga)) as Task;
-        yield race([ take(STOP),
-                    take(CLEAR) ]);
-        yield cancel(asyncTask);
-    }
-}
+export function* rootSaga(): Generator<YieldType, void, Task> {}
killedBy: sagas Root Saga take
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"@@redux-saga/IO": true, "combinator": false, "payload": {"pattern": "START"}, "type": "TAKE"}
Received: undefined

[Killed] ConditionalExpression
Study/Project_gol_saga/src/sagas.ts:33:12
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
 
 export function* rootSaga(): Generator<YieldType, void, Task> {
-    while (yield take(START)) {
+    while (false) {
         const asyncTask: Task = (yield fork(timerSaga)) as Task;
         yield race([ take(STOP),
killedBy: sagas Root Saga take
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"@@redux-saga/IO": true, "combinator": false, "payload": {"pattern": "START"}, "type": "TAKE"}
Received: undefined

[Survived] BlockStatement
Study/Project_gol_saga/src/sagas.ts:33:31
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
 
 export function* rootSaga(): Generator<YieldType, void, Task> {
-    while (yield take(START)) {
-        const asyncTask: Task = (yield fork(timerSaga)) as Task;
-        yield race([ take(STOP),
-                    take(CLEAR) ]);
-        yield cancel(asyncTask);
-    }
+    while (yield take(START)) {}
 }

[Survived] ArrayDeclaration
Study/Project_gol_saga/src/sagas.ts:35:20
 export function* rootSaga(): Generator<YieldType, void, Task> {
     while (yield take(START)) {
         const asyncTask: Task = (yield fork(timerSaga)) as Task;
-        yield race([ take(STOP),
-                    take(CLEAR) ]);
+        yield race([]);
         yield cancel(asyncTask);
     }
