[NoCoverage] BlockStatement
Project_gol_saga/src/stories/Button.tsx:36:20
   backgroundColor,
   label,
   ...props
-}: ButtonProps) => {
-  const mode = primary ? 'storybook-button--primary' : 'storybook-button--secondary';
-  return (
-    <button
-      type="button"
-      className={['storybook-button', `storybook-button--${size}`, mode].join(' ')}
-      style={{ backgroundColor }}
-      {...props}
-    >
-      {label}
-    </button>
-  );
-};
+}: ButtonProps) => {};
 

[NoCoverage] StringLiteral
Project_gol_saga/src/stories/Button.tsx:37:26
   label,
   ...props
 }: ButtonProps) => {
-  const mode = primary ? 'storybook-button--primary' : 'storybook-button--secondary';
+  const mode = primary ? "" : 'storybook-button--secondary';
   return (
     <button
