[NoCoverage] ArrowFunction
Project_gol_saga/src/stories/Page.tsx:17:18
     <article>
       <Header
         user={user}
-        onLogin={() => setUser({ name: 'Jane Doe' })}
+        onLogin={() => undefined}
         onLogout={() => setUser(undefined)}
         onCreateAccount={() => setUser({ name: 'Jane Doe' })}

[NoCoverage] ArrowFunction
Project_gol_saga/src/stories/Page.tsx:18:19
       <Header
         user={user}
         onLogin={() => setUser({ name: 'Jane Doe' })}
-        onLogout={() => setUser(undefined)}
+        onLogout={() => undefined}
         onCreateAccount={() => setUser({ name: 'Jane Doe' })}
       />

[NoCoverage] ArrowFunction
Project_gol_saga/src/stories/Page.tsx:19:26
         user={user}
         onLogin={() => setUser({ name: 'Jane Doe' })}
         onLogout={() => setUser(undefined)}
-        onCreateAccount={() => setUser({ name: 'Jane Doe' })}
+        onCreateAccount={() => undefined}
       />
 
