[NoCoverage] UnaryOperator
Project_gol_saga/src/tmp/Game1.tsx:15:4
 const numColumns = 50;
 const timerMs = 50;
 const nearOps = [
-  [-1, -1],
+  [+1, -1],
   [-1, 0],
   [-1, 1],

[NoCoverage] UnaryOperator
Project_gol_saga/src/tmp/Game1.tsx:15:8
 const numColumns = 50;
 const timerMs = 50;
 const nearOps = [
-  [-1, -1],
+  [-1, +1],
   [-1, 0],
   [-1, 1],

[NoCoverage] UnaryOperator
Project_gol_saga/src/tmp/Game1.tsx:16:4
 const timerMs = 50;
 const nearOps = [
   [-1, -1],
-  [-1, 0],
+  [+1, 0],
   [-1, 1],
   [0, -1],

[NoCoverage] UnaryOperator
Project_gol_saga/src/tmp/Game1.tsx:17:4
 const nearOps = [
   [-1, -1],
   [-1, 0],
-  [-1, 1],
+  [+1, 1],
   [0, -1],
   [0, 1],

[NoCoverage] UnaryOperator
Project_gol_saga/src/tmp/Game1.tsx:18:7
   [-1, -1],
   [-1, 0],
   [-1, 1],
-  [0, -1],
+  [0, +1],
   [0, 1],
   [1, -1],

[NoCoverage] ArrayDeclaration
Project_gol_saga/src/tmp/Game1.tsx:18:3
   [-1, -1],
   [-1, 0],
   [-1, 1],
-  [0, -1],
+  [],
   [0, 1],
   [1, -1],

[NoCoverage] UnaryOperator
Project_gol_saga/src/tmp/Game1.tsx:20:7
   [-1, 1],
   [0, -1],
   [0, 1],
-  [1, -1],
+  [1, +1],
   [1, 0],
   [1, 1]

[NoCoverage] ArrayDeclaration
Project_gol_saga/src/tmp/Game1.tsx:20:3
   [-1, 1],
   [0, -1],
   [0, 1],
-  [1, -1],
+  [],
   [1, 0],
   [1, 1]

[NoCoverage] ArrayDeclaration
Project_gol_saga/src/tmp/Game1.tsx:21:3
   [0, -1],
   [0, 1],
   [1, -1],
-  [1, 0],
+  [],
   [1, 1]
 ]

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:27:54
 
 export type TableType = (0|1)[][];
 
-const generateTable = (empty: boolean): TableType => {
-  const rows = [];
-  for (let r = 0; r < numRows; r++) {
-    rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= 0.9 ? 1 : 0));
-  }
-  return rows;
-}
+const generateTable = (empty: boolean): TableType => {}
 
 export const generateNextGen = ( table: TableType ): TableType => {

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:29:19
 
 const generateTable = (empty: boolean): TableType => {
   const rows = [];
-  for (let r = 0; r < numRows; r++) {
+  for (let r = 0; r <= numRows; r++) {
     rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= 0.9 ? 1 : 0));
   }

[NoCoverage] UpdateOperator
Project_gol_saga/src/tmp/Game1.tsx:29:32
 
 const generateTable = (empty: boolean): TableType => {
   const rows = [];
-  for (let r = 0; r < numRows; r++) {
+  for (let r = 0; r < numRows; r--) {
     rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= 0.9 ? 1 : 0));
   }

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:30:63
 const generateTable = (empty: boolean): TableType => {
   const rows = [];
   for (let r = 0; r < numRows; r++) {
-    rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= 0.9 ? 1 : 0));
+    rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() < 0.9 ? 1 : 0));
   }
   return rows;

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:30:45
 const generateTable = (empty: boolean): TableType => {
   const rows = [];
   for (let r = 0; r < numRows; r++) {
-    rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= 0.9 ? 1 : 0));
+    rows.push(Array.from(Array(numColumns), () => undefined));
   }
   return rows;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:35:67
   return rows;
 }
 
-export const generateNextGen = ( table: TableType ): TableType => {
-  const newTable: TableType = JSON.parse(JSON.stringify(table));
-  const rowsCount = newTable.length;
-  const colsCount = newTable[0]?.length ?? 0;
-  for (let r = 0; r < rowsCount; r++) {
-    for (let c = 0; c < colsCount; c++) {
-      let nearCount = 0;
-      nearOps.forEach(([x, y]) => {
-        const newR = r + x;
-        const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
-          nearCount += table[newR][newC];
-        }
-      })
-      if (nearCount < 2 || nearCount > 3) {
-        newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
-        newTable[r][c] = 1;
-      }
-    }
-  };
-  return newTable;
-}
+export const generateNextGen = ( table: TableType ): TableType => {}
 
 //Actions

[NoCoverage] LogicalOperator
Project_gol_saga/src/tmp/Game1.tsx:38:21
 export const generateNextGen = ( table: TableType ): TableType => {
   const newTable: TableType = JSON.parse(JSON.stringify(table));
   const rowsCount = newTable.length;
-  const colsCount = newTable[0]?.length ?? 0;
+  const colsCount = newTable[0]?.length && 0;
   for (let r = 0; r < rowsCount; r++) {
     for (let c = 0; c < colsCount; c++) {

[NoCoverage] OptionalChaining
Project_gol_saga/src/tmp/Game1.tsx:38:21
 export const generateNextGen = ( table: TableType ): TableType => {
   const newTable: TableType = JSON.parse(JSON.stringify(table));
   const rowsCount = newTable.length;
-  const colsCount = newTable[0]?.length ?? 0;
+  const colsCount = newTable[0].length ?? 0;
   for (let r = 0; r < rowsCount; r++) {
     for (let c = 0; c < colsCount; c++) {

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:39:19
   const newTable: TableType = JSON.parse(JSON.stringify(table));
   const rowsCount = newTable.length;
   const colsCount = newTable[0]?.length ?? 0;
-  for (let r = 0; r < rowsCount; r++) {
+  for (let r = 0; r <= rowsCount; r++) {
     for (let c = 0; c < colsCount; c++) {
       let nearCount = 0;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:39:39
   const newTable: TableType = JSON.parse(JSON.stringify(table));
   const rowsCount = newTable.length;
   const colsCount = newTable[0]?.length ?? 0;
-  for (let r = 0; r < rowsCount; r++) {
-    for (let c = 0; c < colsCount; c++) {
-      let nearCount = 0;
-      nearOps.forEach(([x, y]) => {
-        const newR = r + x;
-        const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
-          nearCount += table[newR][newC];
-        }
-      })
-      if (nearCount < 2 || nearCount > 3) {
-        newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
-        newTable[r][c] = 1;
-      }
-    }
-  };
+  for (let r = 0; r < rowsCount; r++) {};
   return newTable;
 }

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:40:21
   const rowsCount = newTable.length;
   const colsCount = newTable[0]?.length ?? 0;
   for (let r = 0; r < rowsCount; r++) {
-    for (let c = 0; c < colsCount; c++) {
+    for (let c = 0; c <= colsCount; c++) {
       let nearCount = 0;
       nearOps.forEach(([x, y]) => {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:40:41
   const rowsCount = newTable.length;
   const colsCount = newTable[0]?.length ?? 0;
   for (let r = 0; r < rowsCount; r++) {
-    for (let c = 0; c < colsCount; c++) {
-      let nearCount = 0;
-      nearOps.forEach(([x, y]) => {
-        const newR = r + x;
-        const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
-          nearCount += table[newR][newC];
-        }
-      })
-      if (nearCount < 2 || nearCount > 3) {
-        newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
-        newTable[r][c] = 1;
-      }
-    }
+    for (let c = 0; c < colsCount; c++) {}
   };
   return newTable;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:42:35
   for (let r = 0; r < rowsCount; r++) {
     for (let c = 0; c < colsCount; c++) {
       let nearCount = 0;
-      nearOps.forEach(([x, y]) => {
-        const newR = r + x;
-        const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
-          nearCount += table[newR][newC];
-        }
-      })
+      nearOps.forEach(([x, y]) => {})
       if (nearCount < 2 || nearCount > 3) {
         newTable[r][c] = 0;

[NoCoverage] ArithmeticOperator
Project_gol_saga/src/tmp/Game1.tsx:43:22
     for (let c = 0; c < colsCount; c++) {
       let nearCount = 0;
       nearOps.forEach(([x, y]) => {
-        const newR = r + x;
+        const newR = r - x;
         const newC = c + y;
         if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {

[NoCoverage] ArithmeticOperator
Project_gol_saga/src/tmp/Game1.tsx:44:22
       let nearCount = 0;
       nearOps.forEach(([x, y]) => {
         const newR = r + x;
-        const newC = c + y;
+        const newC = c - y;
         if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
           nearCount += table[newR][newC];

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:45:13
       nearOps.forEach(([x, y]) => {
         const newR = r + x;
         const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
+        if (newR < 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
           nearCount += table[newR][newC];
         }

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:45:13
       nearOps.forEach(([x, y]) => {
         const newR = r + x;
         const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
+        if (false) {
           nearCount += table[newR][newC];
         }

[NoCoverage] AssignmentOperator
Project_gol_saga/src/tmp/Game1.tsx:46:11
         const newR = r + x;
         const newC = c + y;
         if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
-          nearCount += table[newR][newC];
+          nearCount -= table[newR][newC];
         }
       })

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:49:28
           nearCount += table[newR][newC];
         }
       })
-      if (nearCount < 2 || nearCount > 3) {
+      if (nearCount < 2 || nearCount >= 3) {
         newTable[r][c] = 0;
       } else if (table[r][c] === 0 && nearCount === 3) {

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:49:11
           nearCount += table[newR][newC];
         }
       })
-      if (nearCount < 2 || nearCount > 3) {
+      if (false) {
         newTable[r][c] = 0;
       } else if (table[r][c] === 0 && nearCount === 3) {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:51:56
       })
       if (nearCount < 2 || nearCount > 3) {
         newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
-        newTable[r][c] = 1;
-      }
+      } else if (table[r][c] === 0 && nearCount === 3) {}
     }
   };

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/Game1.tsx:51:18
       })
       if (nearCount < 2 || nearCount > 3) {
         newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
+      } else if (table[r][c] !== 0 && nearCount === 3) {
         newTable[r][c] = 1;
       }

[NoCoverage] StringLiteral
Project_gol_saga/src/tmp/Game1.tsx:61:15
 
 //Actions
 const GENERATE = "GENERATE";
-const CLEAR = "CLEAR";
+const CLEAR = "";
 const START = "START";
 const STOP = "STOP";

[NoCoverage] StringLiteral
Project_gol_saga/src/tmp/Game1.tsx:63:14
 const GENERATE = "GENERATE";
 const CLEAR = "CLEAR";
 const START = "START";
-const STOP = "STOP";
+const STOP = "";
 const NEXT_GENERATION = "NEXT_GENERATION";
 

[NoCoverage] StringLiteral
Project_gol_saga/src/tmp/Game1.tsx:64:25
 const CLEAR = "CLEAR";
 const START = "START";
 const STOP = "STOP";
-const NEXT_GENERATION = "NEXT_GENERATION";
+const NEXT_GENERATION = "";
 
 //Reducers

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/Game1.tsx:67:22
 const NEXT_GENERATION = "NEXT_GENERATION";
 
 //Reducers
-const initialState = {
-  table: generateTable(false),
-  running: false
-};
+const initialState = {};
 
 const table: Reducer<TableType> = (state = initialState.table, action: Action) => {

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:68:24
 
 //Reducers
 const initialState = {
-  table: generateTable(false),
+  table: generateTable(true),
   running: false
 };

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:69:12
 //Reducers
 const initialState = {
   table: generateTable(false),
-  running: false
+  running: true
 };
 

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:72:83
   running: false
 };
 
-const table: Reducer<TableType> = (state = initialState.table, action: Action) => {
-  switch (action.type) {
-    case GENERATE:
-      return generateTable(false);
-    case CLEAR:
-      return generateTable(true);
-    case NEXT_GENERATION:
-      return generateNextGen(state);
-    default:
-      return state;
-  }
-};
+const table: Reducer<TableType> = (state = initialState.table, action: Action) => {};
 
 //Running reducer

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:74:5
 
 const table: Reducer<TableType> = (state = initialState.table, action: Action) => {
   switch (action.type) {
-    case GENERATE:
-      return generateTable(false);
+    case GENERATE:
     case CLEAR:
       return generateTable(true);

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:75:28
 const table: Reducer<TableType> = (state = initialState.table, action: Action) => {
   switch (action.type) {
     case GENERATE:
-      return generateTable(false);
+      return generateTable(true);
     case CLEAR:
       return generateTable(true);

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:76:5
   switch (action.type) {
     case GENERATE:
       return generateTable(false);
-    case CLEAR:
-      return generateTable(true);
+    case CLEAR:
     case NEXT_GENERATION:
       return generateNextGen(state);

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:77:28
     case GENERATE:
       return generateTable(false);
     case CLEAR:
-      return generateTable(true);
+      return generateTable(false);
     case NEXT_GENERATION:
       return generateNextGen(state);

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:78:5
       return generateTable(false);
     case CLEAR:
       return generateTable(true);
-    case NEXT_GENERATION:
-      return generateNextGen(state);
+    case NEXT_GENERATION:
     default:
       return state;

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:80:5
       return generateTable(true);
     case NEXT_GENERATION:
       return generateNextGen(state);
-    default:
-      return state;
+    default:
   }
 };

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:86:85
 };
 
 //Running reducer
-const running: Reducer<boolean> = (state = initialState.running, action: Action) => {
-  switch (action.type) {
-    case CLEAR:
-      return false;
-    case START:
-      return true;
-    case STOP:
-      return false;
-    default:
-      return state;
-  }
-};
+const running: Reducer<boolean> = (state = initialState.running, action: Action) => {};
 
 export const rootReducer = combineReducers({

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:88:5
 //Running reducer
 const running: Reducer<boolean> = (state = initialState.running, action: Action) => {
   switch (action.type) {
-    case CLEAR:
-      return false;
+    case CLEAR:
     case START:
       return true;

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:89:14
 const running: Reducer<boolean> = (state = initialState.running, action: Action) => {
   switch (action.type) {
     case CLEAR:
-      return false;
+      return true;
     case START:
       return true;

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:90:5
   switch (action.type) {
     case CLEAR:
       return false;
-    case START:
-      return true;
+    case START:
     case STOP:
       return false;

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:91:14
     case CLEAR:
       return false;
     case START:
-      return true;
+      return false;
     case STOP:
       return false;

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:92:5
       return false;
     case START:
       return true;
-    case STOP:
-      return false;
+    case STOP:
     default:
       return state;

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/Game1.tsx:93:14
     case START:
       return true;
     case STOP:
-      return false;
+      return true;
     default:
       return state;

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:94:5
       return true;
     case STOP:
       return false;
-    default:
-      return state;
+    default:
   }
 };

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/Game1.tsx:99:44
   }
 };
 
-export const rootReducer = combineReducers({
-  table,
-  running
-});
+export const rootReducer = combineReducers({});
 
 // Store

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:113:18
 );
 
 // Saga
-function timer() {
-  return eventChannel(emitter => {
-    const iv = setInterval(() => {
-      emitter(timerMs);
-    }, timerMs);
-    return () => {
-      clearInterval(iv);
-    };
-  });
-}
+function timer() {}
 
 function* timerSaga(): Generator<any> {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:114:34
 
 // Saga
 function timer() {
-  return eventChannel(emitter => {
-    const iv = setInterval(() => {
-      emitter(timerMs);
-    }, timerMs);
-    return () => {
-      clearInterval(iv);
-    };
-  });
+  return eventChannel(emitter => {});
 }
 

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:124:39
   });
 }
 
-function* timerSaga(): Generator<any> {
-  const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
-  try {
-    while (true) {
-      yield take(chan);
-      yield put({ type: NEXT_GENERATION });
-    }
-  } finally {
-    if (yield cancelled) {
-      chan.close();
-    }
-  }
-}
+function* timerSaga(): Generator<any> {}
 
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:132:26
       yield put({ type: NEXT_GENERATION });
     }
   } finally {
-    if (yield cancelled) {
-      chan.close();
-    }
+    if (yield cancelled) {}
   }
 }

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:139:56
 }
 
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
-function* rootSaga(): Generator<YieldType, void, Task> {
-  while (yield take(START)) {
-    const asyncTask: Task = (yield fork(timerSaga)) as Task;
-    yield race([ take(STOP),
-                 take(CLEAR) ]);
-    yield cancel(asyncTask);
-  }
-}
+function* rootSaga(): Generator<YieldType, void, Task> {}
 
 sagaMiddleware.run(rootSaga as Saga);

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:140:29
 
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
 function* rootSaga(): Generator<YieldType, void, Task> {
-  while (yield take(START)) {
-    const asyncTask: Task = (yield fork(timerSaga)) as Task;
-    yield race([ take(STOP),
-                 take(CLEAR) ]);
-    yield cancel(asyncTask);
-  }
+  while (yield take(START)) {}
 }
 

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/Game1.tsx:140:10
 
 type YieldType = TakeEffect | ForkEffect<Generator> | RaceEffect<TakeEffect> | CancelEffect;
 function* rootSaga(): Generator<YieldType, void, Task> {
-  while (yield take(START)) {
+  while (false) {
     const asyncTask: Task = (yield fork(timerSaga)) as Task;
     yield race([ take(STOP),

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:155:15
   table: TableType;
 };
 
-const Table = ( table: TableObject) => (
-  <div style={{display: 'grid', gridTemplateColumns: `repeat(${numColumns}, 12px)`}}>
-    {table.table.map((rows, i) => rows.map(
-      (col, j) => 
-        <Cell key={`${i}|${j}`} value={table.table[i][j]}/>
-      )
-    )}
-  </div>
-);
+const Table = () => undefined;
 
 const TestTable = ( table: TableType) => {

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:157:22
 
 const Table = ( table: TableObject) => (
   <div style={{display: 'grid', gridTemplateColumns: `repeat(${numColumns}, 12px)`}}>
-    {table.table.map((rows, i) => rows.map(
-      (col, j) => 
-        <Cell key={`${i}|${j}`} value={table.table[i][j]}/>
-      )
+    {table.table.map(() => undefined
     )}
   </div>

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:158:7
 const Table = ( table: TableObject) => (
   <div style={{display: 'grid', gridTemplateColumns: `repeat(${numColumns}, 12px)`}}>
     {table.table.map((rows, i) => rows.map(
-      (col, j) => 
-        <Cell key={`${i}|${j}`} value={table.table[i][j]}/>
+      () => undefined
       )
     )}

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:165:42
   </div>
 );
 
-const TestTable = ( table: TableType) => {
-  return (
-  <div>{JSON.stringify(table)}</div>
-)
-};
+const TestTable = ( table: TableType) => {};
 
 export type ActionExecutor = () => void;

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:181:14
   generate: ActionExecutor,
   clear: ActionExecutor
 }
-const Game = (data: GameParams
-) => (
-  <div>
-    <button onClick={data.running ? data.stop : data.start}>
-      {data.running ? "stop" : "start"}
-    </button>
-    <button onClick={data.clear}>clear</button>
-    <button onClick={data.generate}>generate</button>
-    <Table table={data.table} />
-  </div>
-);
+const Game = () => undefined;
 
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');

[NoCoverage] StringLiteral
Project_gol_saga/src/tmp/Game1.tsx:185:23
 ) => (
   <div>
     <button onClick={data.running ? data.stop : data.start}>
-      {data.running ? "stop" : "start"}
+      {data.running ? "" : "start"}
     </button>
     <button onClick={data.clear}>clear</button>

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game1.tsx:196:30
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');
 const root = createRoot(rootElement);
 
-export function renderGame() {
-  root.render(
-    <Game
-      table={store.getState().table}
-      running={store.getState().running}
-      start={() => store.dispatch({ type: START })}
-      stop={() => store.dispatch({ type: STOP })}
-      clear={() => store.dispatch({ type: CLEAR })}
-      generate={() => store.dispatch({ type: GENERATE })}
-    />
-  );
-}
+export function renderGame() {}
 
 export default Game;

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:201:14
     <Game
       table={store.getState().table}
       running={store.getState().running}
-      start={() => store.dispatch({ type: START })}
+      start={() => undefined}
       stop={() => store.dispatch({ type: STOP })}
       clear={() => store.dispatch({ type: CLEAR })}

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:202:13
       table={store.getState().table}
       running={store.getState().running}
       start={() => store.dispatch({ type: START })}
-      stop={() => store.dispatch({ type: STOP })}
+      stop={() => undefined}
       clear={() => store.dispatch({ type: CLEAR })}
       generate={() => store.dispatch({ type: GENERATE })}

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:203:14
       running={store.getState().running}
       start={() => store.dispatch({ type: START })}
       stop={() => store.dispatch({ type: STOP })}
-      clear={() => store.dispatch({ type: CLEAR })}
+      clear={() => undefined}
       generate={() => store.dispatch({ type: GENERATE })}
     />

[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game1.tsx:204:17
       start={() => store.dispatch({ type: START })}
       stop={() => store.dispatch({ type: STOP })}
       clear={() => store.dispatch({ type: CLEAR })}
-      generate={() => store.dispatch({ type: GENERATE })}
+      generate={() => undefined}
     />
   );

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/Game1.tsx:204:38
       start={() => store.dispatch({ type: START })}
       stop={() => store.dispatch({ type: STOP })}
       clear={() => store.dispatch({ type: CLEAR })}
-      generate={() => store.dispatch({ type: GENERATE })}
+      generate={() => store.dispatch({})}
     />
   );
