[NoCoverage] ArrowFunction
Project_gol_saga/src/tmp/Game2.tsx:20:14
   clear: ActionExecutor
 }
 
-const Game = (data: GameParams
-) => (
-  <div>
-    <button onClick={data.running ? data.stop : data.start}>
-      {data.running ? "stop" : "start"}
-    </button>
-    <button onClick={data.clear}>clear</button>
-    <button onClick={data.generate}>generate</button>
-    <Table table={data.table} />
-  </div>
-);
+const Game = () => undefined;
 
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');

[NoCoverage] StringLiteral
Project_gol_saga/src/tmp/Game2.tsx:24:32
 ) => (
   <div>
     <button onClick={data.running ? data.stop : data.start}>
-      {data.running ? "stop" : "start"}
+      {data.running ? "stop" : ""}
     </button>
     <button onClick={data.clear}>clear</button>

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/Game2.tsx:35:30
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');
 const root = createRoot(rootElement);
 
-export function renderGame() {
-  root.render(
-    <Provider store={store}>
-        <Game
-            table={store.getState().table}
-            running={store.getState().running}
-            start={() => store.dispatch({ type: START })}
-            stop={() => store.dispatch({ type: STOP })}
-            clear={() => store.dispatch({ type: CLEAR })}
-            generate={() => store.dispatch({ type: GENERATE })}
-        />
-    </Provider>
-  );
-}
+export function renderGame() {}
 
 export default Game;

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/Game2.tsx:42:40
             table={store.getState().table}
             running={store.getState().running}
             start={() => store.dispatch({ type: START })}
-            stop={() => store.dispatch({ type: STOP })}
+            stop={() => store.dispatch({})}
             clear={() => store.dispatch({ type: CLEAR })}
             generate={() => store.dispatch({ type: GENERATE })}

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/Game2.tsx:43:41
             running={store.getState().running}
             start={() => store.dispatch({ type: START })}
             stop={() => store.dispatch({ type: STOP })}
-            clear={() => store.dispatch({ type: CLEAR })}
+            clear={() => store.dispatch({})}
             generate={() => store.dispatch({ type: GENERATE })}
         />
