[NoCoverage] ArrowFunction
src/tmp/backup/App.tsx:8:15
 import { GENERATE, START, STOP, CLEAR } from './game';
 import { Game } from './components/Game';
 
-const start = () => store.dispatch({ type: START });
+const start = () => undefined;
 const stop = () => store.dispatch({ type: STOP });
 const clear = () => store.dispatch({ type: CLEAR });

[NoCoverage] ArrowFunction
src/tmp/backup/App.tsx:9:14
 import { Game } from './components/Game';
 
 const start = () => store.dispatch({ type: START });
-const stop = () => store.dispatch({ type: STOP });
+const stop = () => undefined;
 const clear = () => store.dispatch({ type: CLEAR });
 const generate = () => store.dispatch({ type: GENERATE });

[NoCoverage] ArrowFunction
src/tmp/backup/App.tsx:10:15
 
 const start = () => store.dispatch({ type: START });
 const stop = () => store.dispatch({ type: STOP });
-const clear = () => store.dispatch({ type: CLEAR });
+const clear = () => undefined;
 const generate = () => store.dispatch({ type: GENERATE });
 

[NoCoverage] ObjectLiteral
src/tmp/backup/App.tsx:10:36
 
 const start = () => store.dispatch({ type: START });
 const stop = () => store.dispatch({ type: STOP });
-const clear = () => store.dispatch({ type: CLEAR });
+const clear = () => store.dispatch({});
 const generate = () => store.dispatch({ type: GENERATE });
 

[NoCoverage] ArrowFunction
src/tmp/backup/App.tsx:11:18
 const start = () => store.dispatch({ type: START });
 const stop = () => store.dispatch({ type: STOP });
 const clear = () => store.dispatch({ type: CLEAR });
-const generate = () => store.dispatch({ type: GENERATE });
+const generate = () => undefined;
 
 const App: FC = () => {

[NoCoverage] BlockStatement
src/tmp/backup/App.tsx:13:23
 const clear = () => store.dispatch({ type: CLEAR });
 const generate = () => store.dispatch({ type: GENERATE });
 
-const App: FC = () => {
-    //const start = useCallback(() => store.dispatch({ type: START }), []);
-    return <Provider store={store}>
-        <Game {...store.getState()}
-            start={start}
-            stop={stop}
-            clear={clear}
-            generate={generate}
-        />
-    </Provider>
-};
+const App: FC = () => {};
 
 const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');

[NoCoverage] StringLiteral
src/tmp/backup/App.tsx:25:58
     </Provider>
 };
 
-const rootElement: HTMLElement = document.getElementById('root') ?? document.createElement('');
+const rootElement: HTMLElement = document.getElementById("") ?? document.createElement('');
 const root = createRoot(rootElement);
 
