[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:16:112
     randomValue: number;
 }
 
-const generateTable = (empty: boolean, numRows: number, numColumns: number, randomValue: number): TableType => {
-    const rows = [];
-    for (let r = 0; r < numRows; r++) {
-      rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= randomValue ? 1 : 0));
-    }
-    return rows;
-}
+const generateTable = (empty: boolean, numRows: number, numColumns: number, randomValue: number): TableType => {}
  
 export const getInitialState = (): State => {

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/game_tmp.ts:19:65
 const generateTable = (empty: boolean, numRows: number, numColumns: number, randomValue: number): TableType => {
     const rows = [];
     for (let r = 0; r < numRows; r++) {
-      rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= randomValue ? 1 : 0));
+      rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() > randomValue ? 1 : 0));
     }
     return rows;

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/game_tmp.ts:19:65
 const generateTable = (empty: boolean, numRows: number, numColumns: number, randomValue: number): TableType => {
     const rows = [];
     for (let r = 0; r < numRows; r++) {
-      rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= randomValue ? 1 : 0));
+      rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() < randomValue ? 1 : 0));
     }
     return rows;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:24:45
     return rows;
 }
  
-export const getInitialState = (): State => {
-    return {
-        running: false,
-        rowsCount: 50,
-        columnsCount: 50,
-        randomValue: 0.9,
-        table: generateTable(false, 50, 50, 0.9)
-    };
-};
+export const getInitialState = (): State => {};
 
 const nearOps = [

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/game_tmp.ts:25:12
 }
  
 export const getInitialState = (): State => {
-    return {
-        running: false,
-        rowsCount: 50,
-        columnsCount: 50,
-        randomValue: 0.9,
-        table: generateTable(false, 50, 50, 0.9)
-    };
+    return {};
 };
 

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:26:18
  
 export const getInitialState = (): State => {
     return {
-        running: false,
+        running: true,
         rowsCount: 50,
         columnsCount: 50,

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:30:30
         rowsCount: 50,
         columnsCount: 50,
         randomValue: 0.9,
-        table: generateTable(false, 50, 50, 0.9)
+        table: generateTable(true, 50, 50, 0.9)
     };
 };

[NoCoverage] ArrayDeclaration
Project_gol_saga/src/tmp/game_tmp.ts:34:17
     };
 };
 
-const nearOps = [
-    [-1, -1],
-    [-1, 0],
-    [-1, 1],
-    [0, -1],
-    [0, 1],
-    [1, -1],
-    [1, 0],
-    [1, 1]
-];
+const nearOps = [];
 
 export const generateNextGen = ( table: TableType ): TableType => {

[NoCoverage] ArrayDeclaration
Project_gol_saga/src/tmp/game_tmp.ts:39:5
     [-1, 0],
     [-1, 1],
     [0, -1],
-    [0, 1],
+    [],
     [1, -1],
     [1, 0],

[NoCoverage] ArrayDeclaration
Project_gol_saga/src/tmp/game_tmp.ts:42:5
     [0, 1],
     [1, -1],
     [1, 0],
-    [1, 1]
+    []
 ];
 

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/game_tmp.ts:49:21
     const newTable: TableType = JSON.parse(JSON.stringify(table));
     const rowsCount = newTable.length;
     const colsCount = newTable[0]?.length ?? 0;
-    for (let r = 0; r < rowsCount; r++) {
+    for (let r = 0; r >= rowsCount; r++) {
       for (let c = 0; c < colsCount; c++) {
         let nearCount = 0;

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/game_tmp.ts:50:23
     const rowsCount = newTable.length;
     const colsCount = newTable[0]?.length ?? 0;
     for (let r = 0; r < rowsCount; r++) {
-      for (let c = 0; c < colsCount; c++) {
+      for (let c = 0; false; c++) {
         let nearCount = 0;
         nearOps.forEach(([x, y]) => {

[NoCoverage] LogicalOperator
Project_gol_saga/src/tmp/game_tmp.ts:55:15
         nearOps.forEach(([x, y]) => {
           const newR = r + x;
           const newC = c + y;
-          if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
+          if (newR >= 0 || newC >= 0 && newR < rowsCount && newC < colsCount) {
             nearCount += table[newR][newC];
           }

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/game_tmp.ts:55:15
         nearOps.forEach(([x, y]) => {
           const newR = r + x;
           const newC = c + y;
-          if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
+          if (true) {
             nearCount += table[newR][newC];
           }

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/game_tmp.ts:59:30
             nearCount += table[newR][newC];
           }
         })
-        if (nearCount < 2 || nearCount > 3) {
+        if (nearCount < 2 || false) {
           newTable[r][c] = 0;
         } else if (table[r][c] === 0 && nearCount === 3) {

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/game_tmp.ts:59:13
             nearCount += table[newR][newC];
           }
         })
-        if (nearCount < 2 || nearCount > 3) {
+        if (true) {
           newTable[r][c] = 0;
         } else if (table[r][c] === 0 && nearCount === 3) {

[NoCoverage] EqualityOperator
Project_gol_saga/src/tmp/game_tmp.ts:61:41
         })
         if (nearCount < 2 || nearCount > 3) {
           newTable[r][c] = 0;
-        } else if (table[r][c] === 0 && nearCount === 3) {
+        } else if (table[r][c] === 0 && nearCount !== 3) {
           newTable[r][c] = 1;
         }

[NoCoverage] ObjectLiteral
Project_gol_saga/src/tmp/game_tmp.ts:72:13
 export const gameSlice = createSlice({
   name: 'game',
   initialState: getInitialState(),
-  reducers: {
-    generate: (state) => {
-        state.table = generateTable(false, state.rowsCount, state.columnsCount, state.randomValue);
-    },
-    clear: (state) => {
-        state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);
-        state.running = false;
-    },
-    nextGeneration: (state) => {
-        state.table = generateNextGen(state.table);
-    },
-    start: (state) => {
-        state.running = true;
-    },
-    stop: (state) => {
-        state.running = false;
-    },
-  },
+  reducers: {},
 });
 

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:73:26
   name: 'game',
   initialState: getInitialState(),
   reducers: {
-    generate: (state) => {
-        state.table = generateTable(false, state.rowsCount, state.columnsCount, state.randomValue);
-    },
+    generate: (state) => {},
     clear: (state) => {
         state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:74:37
   initialState: getInitialState(),
   reducers: {
     generate: (state) => {
-        state.table = generateTable(false, state.rowsCount, state.columnsCount, state.randomValue);
+        state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);
     },
     clear: (state) => {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:76:23
     generate: (state) => {
         state.table = generateTable(false, state.rowsCount, state.columnsCount, state.randomValue);
     },
-    clear: (state) => {
-        state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);
-        state.running = false;
-    },
+    clear: (state) => {},
     nextGeneration: (state) => {
         state.table = generateNextGen(state.table);

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:77:37
         state.table = generateTable(false, state.rowsCount, state.columnsCount, state.randomValue);
     },
     clear: (state) => {
-        state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);
+        state.table = generateTable(false, state.rowsCount, state.columnsCount, state.randomValue);
         state.running = false;
     },

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:78:25
     },
     clear: (state) => {
         state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);
-        state.running = false;
+        state.running = true;
     },
     nextGeneration: (state) => {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:80:32
         state.table = generateTable(true, state.rowsCount, state.columnsCount, state.randomValue);
         state.running = false;
     },
-    nextGeneration: (state) => {
-        state.table = generateNextGen(state.table);
-    },
+    nextGeneration: (state) => {},
     start: (state) => {
         state.running = true;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:83:23
     nextGeneration: (state) => {
         state.table = generateNextGen(state.table);
     },
-    start: (state) => {
-        state.running = true;
-    },
+    start: (state) => {},
     stop: (state) => {
         state.running = false;

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:84:25
         state.table = generateNextGen(state.table);
     },
     start: (state) => {
-        state.running = true;
+        state.running = false;
     },
     stop: (state) => {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/game_tmp.ts:86:22
     start: (state) => {
         state.running = true;
     },
-    stop: (state) => {
-        state.running = false;
-    },
+    stop: (state) => {},
   },
 });

[NoCoverage] BooleanLiteral
Project_gol_saga/src/tmp/game_tmp.ts:87:25
         state.running = true;
     },
     stop: (state) => {
-        state.running = false;
+        state.running = true;
     },
   },
