[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/saga_tmp.ts:5:18
 import { take, put, call, CallEffect, RaceEffect, ForkEffect, TakeEffect, SimpleEffect, fork, cancel, cancelled, race, CancelEffect } from "redux-saga/effects";
 import { timerMs, actions } from './game_tmp';
 
-function timer() {
-    return eventChannel(emitter => {
-        const iv = setInterval(() => {
-            emitter(timerMs);
-        }, timerMs);
-        return () => {
-            clearInterval(iv);
-        };
-    });
-}
+function timer() {}
   
 function* timerSaga(): Generator<any> {

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/saga_tmp.ts:16:39
     });
 }
   
-function* timerSaga(): Generator<any> {
-    const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
-    try {
-        while (true) {
-            yield take(chan);
-            yield put(actions.nextGeneration);
-        }
-    } finally {
-        if (yield cancelled) {
-            chan.close();
-        }
-    }
-}
+function* timerSaga(): Generator<any> {}
   
 //type YieldType = TakeEffect | ForkEffect | RaceEffect<TakeEffect> | CancelEffect;

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/saga_tmp.ts:18:9
   
 function* timerSaga(): Generator<any> {
     const chan: EventChannel<number> = (yield call(timer)) as EventChannel<number>;
-    try {
-        while (true) {
-            yield take(chan);
-            yield put(actions.nextGeneration);
-        }
-    } finally {
+    try {} finally {
         if (yield cancelled) {
             chan.close();

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/saga_tmp.ts:31:45
 }
   
 //type YieldType = TakeEffect | ForkEffect | RaceEffect<TakeEffect> | CancelEffect;
-export function* rootSaga(): Generator<any> {
-    console.log("rootSaga");
-    while (yield take()) {
-        console.log("start");
-        const asyncTask: Task = (yield fork(timerSaga)) as Task;
-        yield race([ take(actions.stop),
-                    take(actions.clear) ]);
-        yield cancel(asyncTask);
-    }
-}
+export function* rootSaga(): Generator<any> {}

[NoCoverage] BlockStatement
Project_gol_saga/src/tmp/saga_tmp.ts:33:26
 //type YieldType = TakeEffect | ForkEffect | RaceEffect<TakeEffect> | CancelEffect;
 export function* rootSaga(): Generator<any> {
     console.log("rootSaga");
-    while (yield take()) {
-        console.log("start");
-        const asyncTask: Task = (yield fork(timerSaga)) as Task;
-        yield race([ take(actions.stop),
-                    take(actions.clear) ]);
-        yield cancel(asyncTask);
-    }
+    while (yield take()) {}
 }

[NoCoverage] ConditionalExpression
Project_gol_saga/src/tmp/saga_tmp.ts:33:12
 //type YieldType = TakeEffect | ForkEffect | RaceEffect<TakeEffect> | CancelEffect;
 export function* rootSaga(): Generator<any> {
     console.log("rootSaga");
-    while (yield take()) {
+    while (false) {
         console.log("start");
         const asyncTask: Task = (yield fork(timerSaga)) as Task;

[NoCoverage] StringLiteral
Project_gol_saga/src/tmp/saga_tmp.ts:34:21
 export function* rootSaga(): Generator<any> {
     console.log("rootSaga");
     while (yield take()) {
-        console.log("start");
+        console.log("");
         const asyncTask: Task = (yield fork(timerSaga)) as Task;
         yield race([ take(actions.stop),
