[Killed] ArrowFunction
src/components/Cell/Cell.tsx:13:25
     border-color: black;
     will-change: background-color, border-color;
     transition: border-color 0.1s;
-    background-color: ${(props) => (props.value ? 'cadetblue' : 'white')};
+    background-color: ${() => undefined};
 `;
 
killedBy: Table component check Table render fill
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Table component check Table render fill 1`

- Snapshot  - 16
+ Received  + 16

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Cell/Cell.tsx:20:21
     value: 0|1
 }
 
-export const Cell = ( value: cell ) => (
-    <StyledCell value={value.value} ></StyledCell>
-);
+export const Cell = () => undefined;
 
 /*
killedBy: Table component check Table render fill
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Table component check Table render fill 1`

- Snapshot  - 65
+ Received  +  0

  <DocumentFragment>
