[Killed] ArrowFunction
src/components/Main/Main.tsx:8:22
 import { Game } from '../Game';
 import { Link, useNavigate } from "react-router-dom";
 
-export const start = () => store.dispatch({ type: START });
+export const start = () => undefined;
 export const stop = () => store.dispatch({ type: STOP });
 export const clear = () => store.dispatch({ type: CLEAR });
killedBy: Main component check Main dispatchers
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "START"}
Received: undefined

[Killed] ObjectLiteral
src/components/Main/Main.tsx:8:43
 import { Game } from '../Game';
 import { Link, useNavigate } from "react-router-dom";
 
-export const start = () => store.dispatch({ type: START });
+export const start = () => store.dispatch({});
 export const stop = () => store.dispatch({ type: STOP });
 export const clear = () => store.dispatch({ type: CLEAR });
killedBy: Main component check Main dispatchers
statusReason: Error: Actions may not have an undefined "type" property. You may have misspelled an action type string constant.

[Killed] ArrowFunction
src/components/Main/Main.tsx:9:21
 import { Link, useNavigate } from "react-router-dom";
 
 export const start = () => store.dispatch({ type: START });
-export const stop = () => store.dispatch({ type: STOP });
+export const stop = () => undefined;
 export const clear = () => store.dispatch({ type: CLEAR });
 export const generate = () => store.dispatch({ type: GENERATE });
killedBy: Main component check Main dispatchers
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "STOP"}
Received: undefined

[Killed] ArrowFunction
src/components/Main/Main.tsx:10:22
 
 export const start = () => store.dispatch({ type: START });
 export const stop = () => store.dispatch({ type: STOP });
-export const clear = () => store.dispatch({ type: CLEAR });
+export const clear = () => undefined;
 export const generate = () => store.dispatch({ type: GENERATE });
 
killedBy: Main component check Main dispatchers
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "CLEAR"}
Received: undefined

[Killed] ObjectLiteral
src/components/Main/Main.tsx:10:43
 
 export const start = () => store.dispatch({ type: START });
 export const stop = () => store.dispatch({ type: STOP });
-export const clear = () => store.dispatch({ type: CLEAR });
+export const clear = () => store.dispatch({});
 export const generate = () => store.dispatch({ type: GENERATE });
 
killedBy: Main component check Main dispatchers
statusReason: Error: Actions may not have an undefined "type" property. You may have misspelled an action type string constant.

[Killed] ArrowFunction
src/components/Main/Main.tsx:11:25
 export const start = () => store.dispatch({ type: START });
 export const stop = () => store.dispatch({ type: STOP });
 export const clear = () => store.dispatch({ type: CLEAR });
-export const generate = () => store.dispatch({ type: GENERATE });
+export const generate = () => undefined;
 
 export const Main = () => {
killedBy: Main component check Main dispatchers
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "GENERATE"}
Received: undefined

[Killed] BlockStatement
src/components/Main/Main.tsx:13:27
 export const clear = () => store.dispatch({ type: CLEAR });
 export const generate = () => store.dispatch({ type: GENERATE });
 
-export const Main = () => {
-    //const start = useCallback(() => store.dispatch({ type: START }), []);
-    /*const navigate = useNavigate();
-    const navigateTo = useCallback(() => navigate('/'), []);
-    <Button id='home' label='Home' onClick={navigateTo} primary size='small' />*/
-    return <>
-        <nav>
-            <Link to="/">Home</Link>
-            <p/>
-        </nav>
-        <Provider store={store}>
-            <Game {...store.getState()}
-                start={start}
-                stop={stop}
-                clear={clear}
-                generate={generate}
-            />
-        </Provider>
-    </>
-};
+export const Main = () => {};
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 10037
+ Received  +     1

- <DocumentFragment>
