[Killed] BlockStatement
src/components/Table/Table.tsx:10:52
     table: TableType;
 };
 
-export const Table = ( { table }: TableObject ) => {
-  //console.log(table);
-  return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length ?? 0}, 12px)`}}>
-    {table.map((rows, i) => rows.map(
-      (col, j) => 
-        <Cell key={`${i}|${j}`} value={table[i][j]}/>
-      )
-    )}
-  </div>
-};
+export const Table = ( { table }: TableObject ) => {};
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 10004
+ Received  +     0

@@ -27,10011 +27,7 @@

[Killed] LogicalOperator
src/components/Table/Table.tsx:12:71
 
 export const Table = ( { table }: TableObject ) => {
   //console.log(table);
-  return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length ?? 0}, 12px)`}}>
+  return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length && 0}, 12px)`}}>
     {table.map((rows, i) => rows.map(
       (col, j) => 
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 1
+ Received  + 1

@@ -28,11 +28,11 @@

[Survived] OptionalChaining
src/components/Table/Table.tsx:12:71
 
 export const Table = ( { table }: TableObject ) => {
   //console.log(table);
-  return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length ?? 0}, 12px)`}}>
+  return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0].length ?? 0}, 12px)`}}>
     {table.map((rows, i) => rows.map(
       (col, j) => 

[Killed] ArrowFunction
src/components/Table/Table.tsx:13:16
 export const Table = ( { table }: TableObject ) => {
   //console.log(table);
   return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length ?? 0}, 12px)`}}>
-    {table.map((rows, i) => rows.map(
-      (col, j) => 
-        <Cell key={`${i}|${j}`} value={table[i][j]}/>
-      )
+    {table.map(() => undefined
     )}
   </div>
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 10001
+ Received  +     0

@@ -29,10009 +29,8 @@

[Killed] ArrowFunction
src/components/Table/Table.tsx:14:7
   //console.log(table);
   return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length ?? 0}, 12px)`}}>
     {table.map((rows, i) => rows.map(
-      (col, j) => 
-        <Cell key={`${i}|${j}`} value={table[i][j]}/>
+      () => undefined
       )
     )}
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 10001
+ Received  +     0

@@ -29,10009 +29,8 @@

[Survived] StringLiteral
src/components/Table/Table.tsx:15:20
   return <div style={{display: 'grid', gridTemplateColumns: `repeat(${table[0]?.length ?? 0}, 12px)`}}>
     {table.map((rows, i) => rows.map(
       (col, j) => 
-        <Cell key={`${i}|${j}`} value={table[i][j]}/>
+        <Cell key={``} value={table[i][j]}/>
       )
     )}
