[Killed] ArrayDeclaration
Study/Project_gol_saga/src/game.ts:8:17
 export const numRows = 50;
 export const numColumns = 50;
 const randomizer = 0.8;
-const nearOps = [
-  [-1, -1],
-  [-1, 0],
-  [-1, 1],
-  [0, -1],
-  [0, 1],
-  [1, -1],
-  [1, 0],
-  [1, 1]
-]
+const nearOps = []
 
 export const generateTable = (empty: boolean): TableType => {
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      0,

[Killed] ConditionalExpression
Study/Project_gol_saga/src/game.ts:21:19
 
 export const generateTable = (empty: boolean): TableType => {
   const rows = [];
-  for (let r = 0; r < numRows; r++) {
+  for (let r = 0; false; r++) {
     rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= randomizer ? 1 : 0));
   }
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 10002
+ Received  +     1

@@ -28,10010 +28,9 @@

[Killed] ArrowFunction
Study/Project_gol_saga/src/game.ts:22:45
 export const generateTable = (empty: boolean): TableType => {
   const rows = [];
   for (let r = 0; r < numRows; r++) {
-    rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= randomizer ? 1 : 0));
+    rows.push(Array.from(Array(numColumns), () => undefined));
   }
   return rows;
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 2500
+ Received  +    0

@@ -32,10006 +32,7506 @@

[Killed] ConditionalExpression
Study/Project_gol_saga/src/game.ts:22:63
 export const generateTable = (empty: boolean): TableType => {
   const rows = [];
   for (let r = 0; r < numRows; r++) {
-    rows.push(Array.from(Array(numColumns), () => empty ? 0 : Math.random() >= randomizer ? 1 : 0));
+    rows.push(Array.from(Array(numColumns), () => empty ? 0 : false ? 1 : 0));
   }
   return rows;
killedBy: game table reducer
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
Study/Project_gol_saga/src/game.ts:31:19
   const newTable: TableType = JSON.parse(JSON.stringify(table));
   const rowsCount = newTable.length;
   const colsCount = newTable[0]?.length ?? 0;
-  for (let r = 0; r < rowsCount; r++) {
+  for (let r = 0; false; r++) {
     for (let c = 0; c < colsCount; c++) {
       let nearCount = 0;
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
-     0,

[Killed] EqualityOperator
Study/Project_gol_saga/src/game.ts:37:26
       nearOps.forEach(([x, y]) => {
         const newR = r + x;
         const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
+        if (newR >= 0 && newC > 0 && newR < rowsCount && newC < colsCount) {
           nearCount += table[newR][newC];
         }
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,14 +1,14 @@
  Array [
    Array [

[Killed] ConditionalExpression
Study/Project_gol_saga/src/game.ts:37:59
       nearOps.forEach(([x, y]) => {
         const newR = r + x;
         const newC = c + y;
-        if (newR >= 0 && newC >= 0 && newR < rowsCount && newC < colsCount) {
+        if (newR >= 0 && newC >= 0 && newR < rowsCount && true) {
           nearCount += table[newR][newC];
         }
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,8 +10,8 @@
      1,
    ],

[Killed] BlockStatement
Study/Project_gol_saga/src/game.ts:41:43
           nearCount += table[newR][newC];
         }
       })
-      if (nearCount < 2 || nearCount > 3) {
-        newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
+      if (nearCount < 2 || nearCount > 3) {} else if (table[r][c] === 0 && nearCount === 3) {
         newTable[r][c] = 1;
       }
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,14 +1,14 @@
  Array [
    Array [

[Killed] EqualityOperator
Study/Project_gol_saga/src/game.ts:41:11
           nearCount += table[newR][newC];
         }
       })
-      if (nearCount < 2 || nearCount > 3) {
+      if (nearCount >= 2 || nearCount > 3) {
         newTable[r][c] = 0;
       } else if (table[r][c] === 0 && nearCount === 3) {
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
+     1,

[Killed] ConditionalExpression
Study/Project_gol_saga/src/game.ts:43:39
       })
       if (nearCount < 2 || nearCount > 3) {
         newTable[r][c] = 0;
-      } else if (table[r][c] === 0 && nearCount === 3) {
+      } else if (table[r][c] === 0 && true) {
         newTable[r][c] = 1;
       }
killedBy: game next table
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Array [
    Array [

[Killed] StringLiteral
Study/Project_gol_saga/src/game.ts:53:22
 
 //Actions
 export const GENERATE = "GENERATE";
-export const CLEAR = "CLEAR";
+export const CLEAR = "";
 export const START = "START";
 export const STOP = "STOP";
killedBy: Main component check Main dispatchers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "type": "CLEAR",
+   "type": "",

[Killed] StringLiteral
Study/Project_gol_saga/src/game.ts:55:21
 export const GENERATE = "GENERATE";
 export const CLEAR = "CLEAR";
 export const START = "START";
-export const STOP = "STOP";
+export const STOP = "";
 export const NEXT_GENERATION = "NEXT_GENERATION";
 
killedBy: Main component check Main dispatchers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "type": "STOP",
+   "type": "",

[Killed] BooleanLiteral
Study/Project_gol_saga/src/game.ts:60:24
 
 //Reducers
 export const initialState = {
-  table: generateTable(true),
+  table: generateTable(false),
   running: false
 };
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 1038
+ Received  + 1038

@@ -51,12 +51,12 @@

[Killed] BooleanLiteral
Study/Project_gol_saga/src/game.ts:61:12
 //Reducers
 export const initialState = {
   table: generateTable(true),
-  running: false
+  running: true
 };
 
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 1
+ Received  + 1

@@ -11,11 +11,11 @@
