[Killed] ArrowFunction
src/components/Home/Home.tsx:4:21
 import React from 'react';
 import { Link } from "react-router-dom";
 
-export const Home = () => (
-      <>
-        <nav>
-            <Link to="/about">Game rules</Link>
-            <p/>
-            <Link to="/game">Game</Link>
-        </nav>
-        <main>
-            <h3>Project description</h3>
-            <p>
-                text
-            </p>
-        </main>
-      </>
-);
+export const Home = () => undefined;
killedBy: Home component check Home render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Home component check Home render 1`

- Snapshot  - 23
+ Received  +  1

- <DocumentFragment>
