[NoCoverage] ArrowFunction
src/components/Header/Header.tsx:4:16
 import React from 'react';
 import Link from 'next/link';
 
-const Header = () => (
-  <div>
-    <ul>
-      <li>
-        <Link href="/">
-          <a>Home</a>
-        </Link>
-      </li>
-      <li>
-        <Link href="/about">
-          <a>About</a>
-        </Link>
-      </li>
-      <li>
-        <Link href="/Main">
-          <a>Game</a>
-        </Link>
-      </li>
-    </ul>
-  </div>
-);
+const Header = () => undefined;
 
 export default Header;
