[Killed] BlockStatement
src/components/Main/Main.tsx:13:27
 export const clear = () => store.dispatch({ type: CLEAR });
 export const generate = () => store.dispatch({ type: GENERATE });
 
-export const Main = () => {
-    //const start = useCallback(() => store.dispatch({ type: START }), []);
-    /*const navigate = useNavigate();
-    const navigateTo = useCallback(() => navigate('/'), []);
-    <Button id='home' label='Home' onClick={navigateTo} primary size='small' />*/
-    return <>
-        <nav>
-            <Link to="/">Вернуться на главную</Link>
-            <p/>
-        </nav>;
-        <Provider store={store}>
-            <Game {...store.getState()}
-                start={start}
-                stop={stop}
-                clear={clear}
-                generate={generate}
-            />
-        </Provider>
-    </>
-};
+export const Main = () => {};
killedBy: Main component check Main render
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Main component check Main render 1`

- Snapshot  - 10038
+ Received  +     1

- <DocumentFragment>
